[
    ["Jessica Day (Jessica Christopher \"Jess\" Day)", "Zooey Deschanel", " A bubbly, offbeat teacher in her early thirties who is originally from Portland, Oregon. After discovering in the pilot episode that her live-in boyfriend, Spencer is cheating on her, she moves into the guys' apartment where Nick, Schmidt, and Winston help her move on from her break-up.", "female"],
    ["Nick Miller (Nicholas Miller)", "Jake Johnson", "One of Jess' roommates who works as a bartender. He and Winston are childhood friends from Chicago. At the start of the series, he struggles from having broken up with his long-term girlfriend Caroline.", "Male"],
    ["Schmidt (Winston Saint-Marie Schmidt)", "Max Greenfield", "The guy who originally posted the online ad for a new roommate. He is an overly confident ladies' man who is originally from Long Island, New York.While attending Syracuse University, he was very obese, and shared a dorm room with Nick and became life-long friends.Since then, he has worked hard to lose weight and to be seen as physically attractive and cool.Because of this, he often says offensive or cocky things, and every time he does, his roommates make him put money in the apartment's \"douchebag jar\"", "Male"],
    ["Coach (Ernie Tagliaboo)", "Damon Wayans, Jr.", "Goes by the nickname Coach, is a cocky and driven, yet sometimes awkward former athlete who works as a personal trainer. He is one of the roommates when Jess first moves into the loft in the pilot, but he moves out before the second episode for then-undisclosed reasons, allowing for Winston to take his place", "Male"],
    ["Cece (Cecilia \"Cece\" Parekh)", "Hannah Simone", "Jess' best friend since childhood, a street-smart and snarky fashion model. Although she is fairly serious and cool, she does enjoy parties and has gotten drunk on occasion where she acts more wildly. Her parents were born in India. Initially skeptical of Jess's new roommates, Cece becomes interested in Schmidt after seeing him express his emotionswhile preparing Thanksgiving dinner", "Female"],
    ["Winston Bishop (Winston L'Andre Bishop)", " Lamorne Morris", "A tenacious and somewhat eccentric former basketball player from Chicago and Nick's childhood friend", "Male"],
    ["Ruth (Ruth Bader Parikh-Schmidt)", "Danielle Rockoff and Rhiannon Rockoff", "The daughter of Schmidt and Cece", "Female"],
    ["Caroline", "Mary Elizabeth Ellis", "Nick's ex-girlfriend at the start of the series", "Female"],
    ["Paul Genzlinger", "Justin Long", "A music teacher at Jess's school whom Jess takes a liking to. The guys remark that he is quirky and emotional like a male version of Jess", "Male"],
    ["Gina", "Michaela Watkins", "'Schmidt's boss and the Vice President at Associated Strategies. She is described as \"tough, domineering, unpleasant\"", "Female"],
    ["Sadie", "June Diane Raphael", "Jess's friend who is a lesbian gynecologist", "Female"],
    ["Kim", "Gillian Vigman", "Schmidt's other boss and the CFO at Associated Strategies. She has dark blonde hair. Some of her tasks seem like double entendres to Schmidt", "Female"],
    ["Benjamin", "David Neher", "Schmidt's former college roommate and \"fremesis\"", "Male"],
    ["Tanya Lamontagne", "Rachael Harris", "The vice principal at Jess's school in season 1", "Female"],
    ["Remy", "Jeff Kober", "The creepy landlord of the apartment building that the guys wanted to avoid using whenever possible. When Jess befriends him, he assumes she wants to flirt with him", "Male"],
    ["Julia Cleary", "Lizzy Caplan", "Nick's girlfriend in a story arc in season 1. At first she appears to be the perfect girl to Nick, but later it is revealed she has anger management issues. She is a lawyer who has a contrasting personality to the bubbly Jess", "Female"],
    ["Shelby", "Kali Hawk","Winston's love interest. They had a tryst before Winston went to Latvia, but after much apologizing on Winston's part, she agreed to give him a second chance", "Female"],
    ["Russell Schiller", "Dermot Mulroney", "A divorced father of one of Jess's students", "Male"],
    ["Joe Napoli", "Phil Hendrie", "A sports radio personality who hires Winston as his research assistant. Hendrie himself is a radio personality", "Male"],
    ["Nadia", "Rebecca Reid", "A Russian model and one of Cece's roommates. On Cece's prompting, she and Schmidt have a date", "Female"],
    ["Robby", "Nelson Franklin", "Cece's new boyfriend in the season 2 premiere. Laid-back and nice, he represents a contrast to Schmidt, who sees him as a rival, but later tries to ally with him against Shivrang", "Male"],
    ["Sam Sweeney", "David Walton", "Jess' love interest after she was laid off from teaching", "Male"],
    ["Bearclaw", "Josh Gad", "A beer delivery guy at the bar where Nick works", "Male"],
    ["Tran", "Ralph Ahn", "An elderly Asian man who Nick becomes friends with", "Male"],
    ["Emma", "Carla Gugino", "The Vice President of the North American region of Associated Strategies", "Female"],
    ["Joan Day", "Jamie Lee Curtis", "Jess' mother She and Bob are divorced and she shares some personality quirks with Jess", "Female"],
    ["Bob Day", "Rob Reiner", "Jess' father. Though he admits to having many similarities to Nick, he is very protective of Jess", "Male"],
    ["Ashley", "Kaitlin Olson", "One of Jess' former schoolmates, and marries her in the episode \"Oregon\" , but is divorced again in season 6", "Female"],
    ["Big Schmidt", "Rob Riggle", "Schmidt's rival cousin, first showing at Thanksgiving", "Male"],
    ["Angie", "Olivia Munn", "A bar patron that Nick falls for as she broke up with a boyfriend. She works as a stripper", "Female"],
    ["Walt Miller", "Dennis Farina", "Nick's dad, He is a con man who tries to get Jess to invest in buying a race horse", "Male"],
    ["Shivrang", "Satya Bhabha", "Cece's fiance by arranged marriage", "Male"],
    ["Daisy", "Brenda Song", "Winston's love interest, She is described as competitive and intense and disliking quitters", "Female"],
    ["Outside Dave", "Steve Agee", "A homeless man who lives outside of the apartment building", "Male"],
    ["Elizabeth", "Merritt Wever", "Schmidt's college girlfriend", "Female"],
    ["Alan Foster(Alan principal Foster)", "Curtis Armstrong", "The eccentric principal of Coolidge Middle School","Male"],
    ["Rose", "Angela Kinsey", "A \"snobbish cool teacher\" at Coolidge Middle School", "Female"],
    ["Lorenzo", "Brian Posehn", "Biology Teacher, works at Coolidge Middle School", "Male"],
    ["Bertie", "Jessica Chaffin", "A bus driver who becomes Winston's girlfriend", "Female"],
    ["Mike", "Ben Falcone", "The gay owner of the bar where Nick and Cece work", "Male"],
    ["Abby Day", "Linda Cardellini", "Jess' older sister, described as bit of a wild child. She is frequently in trouble with the law", "Female"],
    ["Ryan Geauxinue", "Julian Morris", "An attractive new science teacher from England who becomes Jess' love interest", "Male"]
]