["Jessica \"Jess\" Day (Zooey Deschanel) is a bubbly and quirky teacher in her early 30s who comes home to find her boyfriend, Spencer, with another woman and leaves him immediately to look for elsewhere to live. After answering an ad for a new roommate on Craigslist, she finds herself moving into a loft in Los Angeles with three men around her own age: Nick, Schmidt, and Coach.\n\n After the pilot episode, Winston, a former roommate and Nick's childhood friend, replaces Coach, who had vacated the apartment to live with his girlfriend. Cece, Jess's childhood best friend and a successful fashion model, frequently visits Jess and the guys. The series follows the group's interactions with each other and their romantic relationships. Midway through season 1, Schmidt and Cece get involved in a mostly sexual relationship but break up at the end of the season.\n\n In Season 2, Jess is laid off from her teaching job; she and the others get involved in mostly temporary relationships, although Cece enters an arranged marriage engagement to Shivrang (Satya Bhabha) that is broken up at their wedding in the season 2 finale. Jess and Nick become romantically attracted to each other, making their relationship official at the end of season 2, and it lasts through most of season 3. \n\nCoach returns to the loft in season 3 after revealing that he had broken up with his girlfriend and stays through season 4 where he moves out to be with another girl. After bouncing around several random jobs, Winston works to become a police officer with the LAPD, and falls in love with his partner Aly. \n\nAt the end of season 4, Schmidt proposes to Cece, and they marry at the end of season 5. Also, in season 5, while Jess is on jury duty, the group brings in temporary roommate Reagan Lucas, whom Nick becomes interested in. \n\nIn season 6, Schmidt and Cece buy a house together that they have to remodel, living with the gang in the meantime. \n\nSeason 7 advances the storyline three years later where Schmidt and Cece have a three-year-old daughter named Ruth, Winston and Aly are expecting their first baby, and Nick proposes to Jess."]